[
  {
    "source": {
      "id": "mashable",
      "name": "Mashable"
    },
    "author": "Kellen Beck",
    "title": "'Resident Evil 2' almost broke me",
    "description": "Resident Evil 2 is a perfect example of how to do a video game remake, taking an outdated yet beloved ‘90s game and rebuilding it into a modern horror masterpiece. Every inch of the Resident Evil 2 remake is engrossing. It’s a masterclass in environmental des…",
    "url": "https://mashable.com/article/resident-evil-2-review/",
    "urlToImage": "https://mondrian.mashable.com/2019%252F01%252F22%252Fc4%252F6b88c56cf06e49f6b77fee8296449e5e.f8edd.png%252F1200x630.png?signature=sO7vqXVrVOGkUb_40A-ep9xu0k4=",
    "publishedAt": "2019-01-22T16:00:00Z",
    "content": "Resident Evil 2 is a perfect example of how to do a video game remake, taking an outdated yet beloved 90s game and rebuilding it into a modern horror masterpiece.\r\nEvery inch of the Resident Evil 2 remake is engrossing. Its a masterclass in environmental desi… [+6510 chars]"
  },
  {
    "source": {
      "id": null,
      "name": "Digitalspy.com"
    },
    "author": null,
    "title": "Pick up Resident Evil 2 for 25% less right now - DigitalSpy.com",
    "description": "Pick up Resident Evil 2 for 25% less right now DigitalSpy.com Resident Evil 2 is not the remake you think it is Polygon Resident Evil 2 Remake Livestream: Is it the Best RE Yet? - IGN Plays Live IGN 21 Brilliant Little Details in Resident Evil 2 - SPOILERS! I…",
    "url": "https://www.digitalspy.com/tech/best-tech-deals/a26034585/resident-evil-2-xbox-one-ps4-pc-deal/",
    "urlToImage": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/keyart-4th-leonclaire-1534761158.jpg?crop=1xw:0.9691xh;center,top&resize=1200:*",
    "publishedAt": "2019-01-25T11:52:00Z",
    "content": "It's time to relive the most terrifying aspects of your childhood with the freshly released remake of Resident Evil 2 on Xbox One, PS4 and PC. We've bought a new, clean pair of underwear... just in case. \r\nCapcom has delivered an upgraded, updated and super-s… [+3282 chars]"
  },
  {
    "source": {
      "id": null,
      "name": "Kotaku.com"
    },
    "author": "Zack Zwiezen",
    "title": "Capcom Really Loves Remaking Resident Evil 2",
    "description": "For many fans, Resident Evil 2 is their favorite game in the long running horror franchise. Later this month Capcom will finally release the Resident Evil 2 remake for PS4, Xbox One and PC. But this isn’t the first time Capcom has remade or re-imagined Reside…",
    "url": "https://kotaku.com/capcom-really-loves-remaking-resident-evil-2-1831879905",
    "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/s--cm0wIRi4--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/ggkhzaqs3xxnxjcgpvc0.jpg",
    "publishedAt": "2019-01-18T20:42:00Z",
    "content": "For many fans, Resident Evil 2 is their favorite game in the long running horror franchise. Later this month Capcom will finally release the Resident Evil 2 remake for PS4, Xbox One and PC. But this isnt the first time Capcom has remade or re-imagined Residen… [+556 chars]"
  },
  {
    "source": {
      "id": null,
      "name": "Kotaku.com"
    },
    "author": "Zack Zwiezen",
    "title": "Resident Evil 2 Remake On PC Has A Fantastic Graphics Menu",
    "description": "Resident Evil 2 is getting positive reviews from both critics and fans. I’ve been playing the game and I have to agree with most folks thoughts on the game. The RE2 remake feels like a wonderful mix of classic Resident Evil gameplay and modern Resident Evil m…",
    "url": "https://kotaku.com/resident-evil-2-remake-on-pc-has-a-fantastic-graphics-m-1832085885",
    "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/s--XxEgfoo0--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/g3u6uiqojkuctizl9laj.jpg",
    "publishedAt": "2019-01-26T20:45:00Z",
    "content": "Resident Evil 2 is getting positive reviews from both critics and fans. Ive been playing the game and I have to agree with most folks thoughts on the game. The RE2 remake feels like a wonderful mix of classic Resident Evil gameplay and modern Resident Evil me… [+2197 chars]"
  },
  {
    "source": {
      "id": null,
      "name": "Kotaku.com"
    },
    "author": "Heather Alexandra",
    "title": "Tips For Playing Resident Evil 2",
    "description": "Whether you’re returning to Racoon City or a first time visitor, Resident Evil 2 ’s mixture of horror and action can be daunting. If you don’t want to get your neck-flesh literally torn off in the new remake, here are a few tips to help you survive. Read more…",
    "url": "https://kotaku.com/tips-for-playing-resident-evil-2-1832052438",
    "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/s--pBAeZzeV--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/devlgonhegfqixs76fzs.png",
    "publishedAt": "2019-01-25T16:30:00Z",
    "content": "Whether youre returning to Racoon City or a first time visitor, Resident Evil 2s mixture of horror and action can be daunting. If you dont want to get your neck-flesh literally torn off in the new remake, here are a few tips to help you survive.\r\nPlay On Norm… [+6675 chars]"
  },
  {
    "source": {
      "id": null,
      "name": "Kotaku.com"
    },
    "author": "Zack Zwiezen",
    "title": "I Can't Stop Buying Resident Evil 4",
    "description": "When I was younger, Resident Evil 4 looked so cool. I remember being so excited to play it. Then I found out that it was only going to be released on the Nintendo Gamecube, which I didn’t own. My dreams were shattered because I was a dumb kid and didn’t reali…",
    "url": "https://kotaku.com/i-cant-stop-buying-resident-evil-4-1831898574",
    "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/s--3j9g-4lV--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/bgbxacibycewhhjpqxuk.jpg",
    "publishedAt": "2019-01-19T22:30:00Z",
    "content": "When I was younger, Resident Evil 4 looked so cool. I remember being so excited to play it. Then I found out that it was only going to be released on the Nintendo Gamecube, which I didnt own. My dreams were shattered because I was a dumb kid and didnt realize… [+1328 chars]"
  },
  {
    "source": {
      "id": null,
      "name": "Kotaku.com"
    },
    "author": "Heather Alexandra",
    "title": "Resident Evil 2: The Kotaku Review",
    "description": "There’s a lot to love about the new Resident Evil 2, from its brash bloodiness to the wide variety of experiences packed into the game. Looking over the wreckage of my playthroughs, my own feelings are complicated. It is an exciting and astounding experience,…",
    "url": "https://kotaku.com/resident-evil-2-the-kotaku-review-1831951036",
    "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/s--jWf1eKno--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/dsbvu73v6gumxltqlocj.png",
    "publishedAt": "2019-01-22T16:00:00Z",
    "content": "Theres a lot to love about the new Resident Evil 2, from its brash bloodiness to the wide variety of experiences packed into the game. Looking over the wreckage of my playthroughs, my own feelings are complicated. It is an exciting and astounding experience, … [+15823 chars]"
  },
  {
    "source": {
      "id": "business-insider",
      "name": "Business Insider"
    },
    "author": "Kevin Webb",
    "title": "The gorgeous remake of 'Resident Evil 2' is the first must-play video game of 2019",
    "description": "The newest game in the Resident Evil franchise is \"Resident Evil 2,\" a remake of the 1998 classic arriving on January 25th, 2019 for PlayStation 4, Xbox One, and PC. \"Resident Evil 2\" is a classic survival horror game; players work to escape the zombie-infest…",
    "url": "https://www.businessinsider.com/resident-evil-2-review-2019-1",
    "urlToImage": "https://amp.businessinsider.com/images/5c49cd262bdd7f6edf0c4b13-1920-960.jpg",
    "publishedAt": "2019-01-24T16:16:15Z",
    "content": "\"Resident Evil 2\" is a classic, this can't be overstated. The original \"Resident Evil\" established the formula for the survival horror genre, and in 1998 \"Resident Evil 2\" helped redefine the limits of 3D action games by doubling down on the action, explorati… [+834 chars]"
  },
  {
    "source": {
      "id": null,
      "name": "Hipertextual.com"
    },
    "author": "SomosXbox",
    "title": "Así es la censura de Resident Evil 2 en Japón",
    "description": "Resident Evil 2 Remake está a la vuelta de la esquina, pero no llegará igual a todos los rincones del mundo: así es la censura de la versión japonesa. Resident Evil 2 ya casi está aquí. El próximo día 25 de enero podremos jugar a la versión final de un juego …",
    "url": "https://hipertextual.com/2019/01/asi-es-censura-resident-evil-2-japon",
    "urlToImage": "https://hipertextual.com/files/2018/12/Resident-Evil-21-4096x2113.jpg",
    "publishedAt": "2019-01-14T15:00:09Z",
    "content": "Resident Evil 2 ya casi está aquí. El próximo día 25 de enero podremos jugar a la versión final de un juego que algunos llevamos esperando mucho, mucho tiempo. Y es que, tras Resident Evil 5 y 6, y Revelations 2, la saga parece que vuelve por sus fueros, y tr… [+1499 chars]"
  },
  {
    "source": {
      "id": "business-insider",
      "name": "Business Insider"
    },
    "author": "Kevin Webb",
    "title": "The opening scenes of 'Resident Evil 2' may give you zombie apocalypse nightmares — watch the first 20 minutes of the game, uncut",
    "description": "The newest game in the \"Resident Evil\" franchise is \"Resident Evil 2,\" a remake of the 1998 classic, arriving today on PlayStation 4, Xbox One, and PC. \"Resident Evil 2\" has been rebuilt from the ground up with stunning graphics and a new control scheme, and …",
    "url": "https://www.businessinsider.com/resident-evil-2-intro-zombie-apocalypse-2019-1",
    "urlToImage": "https://amp.businessinsider.com/images/5c4a2b1f2bdd7f76db5c3515-1920-960.jpg",
    "publishedAt": "2019-01-25T14:00:00Z",
    "content": "This footage was captured on the Xbox One X, at 1080p resolution."
  },
  {
    "source": {
      "id": "ars-technica",
      "name": "Ars Technica"
    },
    "author": "Sam Machkovech",
    "title": "Report: Netflix will continue streak of video game series with Resident Evil",
    "description": "Series will come from films' production company; no showrunner attached yet.",
    "url": "https://arstechnica.com/gaming/2019/01/netflix-is-linked-to-a-resident-evil-live-action-tv-series/",
    "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2019/01/res-ev-760x380.jpg",
    "publishedAt": "2019-01-25T01:26:39Z",
    "content": "Enlarge/ This logo is from one of the series' video games; there's no telling what logo may come from an eventual Netflix take on the series.\r\n1 with 1 posters participating\r\nHours before the newest Resident Evil video game reaches PCs and game consoles, a re… [+1815 chars]"
  },
  {
    "source": {
      "id": "the-next-web",
      "name": "The Next Web"
    },
    "author": "Nino de Vries",
    "title": "Resident Evil 2 raises the bar for video game remakes",
    "description": "Want to feel old? Consider the fact that Resident Evil 2 is now officially old enough to legally drink and vote in the US. With nearly 5 million copies sold on the original PlayStation, RE2 is the series’ best-selling installment on a single platform, yet som…",
    "url": "https://thenextweb.com/?p=1182117",
    "urlToImage": "https://img-cdn.tnwcdn.com/image/tnw?filter_last=1&fit=1280%2C640&url=https%3A%2F%2Fcdn0.tnwcdn.com%2Fwp-content%2Fblogs.dir%2F1%2Ffiles%2F2019%2F01%2FWP1qaFJ.jpg&signature=ccbc384dd3442458428f35c63b7bc120",
    "publishedAt": "2019-01-22T15:59:39Z",
    "content": "Want to feel old? Consider the fact that Resident Evil 2 is now officially old enough to legally drink and vote in the US.\r\nWith nearly 5 million copies sold on the original PlayStation, RE2 is the series best-selling installment on a single platform, yet som… [+5581 chars]"
  },
  {
    "source": {
      "id": null,
      "name": "Kotaku.com"
    },
    "author": "Chris Person",
    "title": "Stop Hitting Yourself",
    "description": "Today on Highlight Reel we have Resident Evil 2 scares, Black Ops 4 kills, Anthem demo moments, and much more! Read more...",
    "url": "https://kotaku.com/stop-hitting-yourself-1832136200",
    "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/s--qkQQUMU7--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/v2hf1en8qqosvop2xgdq.jpg",
    "publishedAt": "2019-01-28T23:00:00Z",
    "content": "Today on Highlight Reel we have Resident Evil 2 scares, Black Ops 4 kills, Anthem demo moments, and much more!\r\nWatch the video then talk about your favorite highlight in the comments below. Be sure to check out, like, and share the original videos via the li… [+510 chars]"
  },
  {
    "source": {
      "id": null,
      "name": "Kotaku.com"
    },
    "author": "Chris Person",
    "title": "Call Of Duty Team Eliminated With One Bullet",
    "description": "Today on Highlight Reel we Kinect-enabled Smash, horse crap gifts, friendly Resident Evil 2 zombies, and much more! Read more...",
    "url": "https://kotaku.com/call-of-duty-team-eliminated-with-one-bullet-1831851427",
    "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/s--iUm5-v_F--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/dnkhj3ppexdbcwzqhjrn.jpg",
    "publishedAt": "2019-01-17T22:30:00Z",
    "content": "Today on Highlight Reel we Kinect-enabled Smash, horse crap gifts, friendly Resident Evil 2 zombies, and much more!\r\nWatch the video then talk about your favorite highlight in the comments below. Be sure to check out, like, and share the original videos via t… [+515 chars]"
  },
  {
    "source": {
      "id": null,
      "name": "Kotaku.com"
    },
    "author": "Chris Person and Heather Alexandra",
    "title": "Here's How Much Resident Evil 2 Has Changed",
    "description": "As you may have seen in our review, a whole lot has changed in the remake of Resident Evil 2. How much, exactly? Take a peek. Read more...",
    "url": "https://kotaku.com/heres-how-much-resident-evil-2-has-changed-1831963035",
    "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/s--m5Juavnx--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/tnwjbaq99bttzt6hbw85.jpg",
    "publishedAt": "2019-01-22T22:30:00Z",
    "content": "As you may have seen in our review,a whole lot has changed in the remake of Resident Evil 2. How much, exactly? Take a peek.\r\nIn the video above, we compared a handful of iconic scenes from the newly-released remake and the 1998 original. How much have the Li… [+121 chars]"
  },
  {
    "source": {
      "id": null,
      "name": "Hipertextual.com"
    },
    "author": "Hobby Consolas",
    "title": "5 trucos que Resident Evil 2 no te cuenta… y que te ayudarán bastante",
    "description": "Te contamos algunos secretos para hacer más llevadera tu noche en las calles y en la comisaría de Raccoon City. Resident Evil 2 Remake esconde un montón de secretos y posibilidades para que, cada partida con Leon y Claire sea un mundo. Lo sabréis en detalle c…",
    "url": "https://hipertextual.com/2019/02/5-trucos-que-resident-evil-2-no-te-cuenta-que-te-ayudaran-bastante",
    "urlToImage": "https://hipertextual.com/files/2018/12/Resident-Evil-21-4096x2113.jpg",
    "publishedAt": "2019-02-06T08:00:08Z",
    "content": "Resident Evil 2 Remake esconde un montón de secretos y posibilidades para que, cada partida con Leon y Claire sea un mundo. Lo sabréis en detalle con sólo echar un vistazo a nuestra guía de Resident Evil 2. Pero, si necesitas un poco de ayuda extra, aquí te v… [+3204 chars]"
  },
  {
    "source": {
      "id": "polygon",
      "name": "Polygon"
    },
    "author": "Emily Heller",
    "title": "A Resident Evil 2 exclusive deal, Super Bowl TV sales and more gaming deals",
    "description": "Save 25 percent off Resident Evil 2 on PC",
    "url": "https://www.polygon.com/deals/2019/1/26/18196215/best-gaming-deals-resident-evil-2-super-bowl-tv-sale-amazon",
    "urlToImage": "https://cdn.vox-cdn.com/thumbor/4xqAoVOvHguHWQ2SYjCVmtVXDNE=/0x108:1500x893/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/13714008/RE2.jpg",
    "publishedAt": "2019-01-26T16:00:00Z",
    "content": "Resident Evil 2 was released yesterday on PC, PS4, and Xbox One. If you havent yet started playing Capcoms remake, which Polygon called everything a video game remake should be, heres even more incentive: Steam key marketplace Fanatical is offering 25 percent… [+1796 chars]"
  },
  {
    "source": {
      "id": null,
      "name": "Boingboing.net"
    },
    "author": "Rob Beschizza",
    "title": "Resident Evil 2 with the facial animation exaggerated 500%",
    "description": "Resident Evil 2 is a just-released remake of the Capcom classic, updated with ultra-realistic performance-captured animation. DPO23 hacked the game's configuration to exaggerate characters' facial movements 500%. It's an unsettling illustration of what lies b…",
    "url": "https://boingboing.net/2019/01/31/resident-evil-2-with-the-facia.html",
    "urlToImage": "https://media.boingboing.net/wp-content/uploads/2019/01/Screen-Shot-2019-01-31-at-9.09.34-AM.jpg",
    "publishedAt": "2019-01-31T14:14:23Z",
    "content": "Deepmind presented an AI that could beat human champions at Starcraft II. It claimed the AI was limited to what human players can physically do, putting its achievement in the realm of strategic analysis rather than finger twitchery. But there’s a problem: it… [+1827 chars]"
  },
  {
    "source": {
      "id": null,
      "name": "Androidcentral.com"
    },
    "author": "Jennifer Locke",
    "title": "Resident Evil 2 Remake is the best PS4 Pro enhanced game out now",
    "description": "PlayStation 4 Pro enhancements vary from game to game, with some focusing on visuals while others pump energy into their performance. Just because a game looks good, though, doesn't mean it is good. The games below strike the perfect balance of being top qual…",
    "url": "https://www.androidcentral.com/best-playstation-4-pro-enhanced-games",
    "urlToImage": "https://www.androidcentral.com/sites/androidcentral.com/files/styles/large/public/article_images/2018/06/resident-evil-2-remake-world.jpg?itok=D82yGqCJ",
    "publishedAt": "2019-01-31T13:00:03Z",
    "content": "PlayStation 4 Pro enhancements vary from game to game, with some focusing on visuals while others pump energy into their performance. Just because a game looks good, though, doesn't mean it is good. The games below strike the perfect balance of being top qual… [+3736 chars]"
  },
  {
    "source": {
      "id": null,
      "name": "Kotaku.com"
    },
    "author": "Paul Tamayo",
    "title": "The Tension Between Remakes And Originals",
    "description": "With the spiffy Resident Evil 2 remake right around the corner, I got to thinking about remakes versus remasters. At what point should you just go back and boot up the original? Read more...",
    "url": "https://kotaku.com/the-tension-between-remakes-and-originals-1831812864",
    "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/s--qiQ_GOTd--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/igjczffrkyxsavqjavpr.jpg",
    "publishedAt": "2019-01-16T20:00:00Z",
    "content": "With the spiffy Resident Evil 2 remake right around the corner, I got to thinking about remakes versus remasters. At what point should you just go back and boot up the original?\r\nIt can be interesting to see a modern take with new mechanics that retains the o… [+1967 chars]"
  }
]